In [46]:
import datetime

In [47]:
import pandas as pd

In [48]:
data = pd.read_csv("sales_data.csv")

In [49]:
data.head()

,Product_ID,Sale_Date,Sales_Rep,Region,Sales_Amount,Quantity_Sold,Product_Category,Unit_Cost,Unit_Price,Customer_Type,Discount,Payment_Method,Sales_Channel,Region_and_Sales_Rep
0,1052,2023-02-03,Bob,North,5053.97,18,Furniture,152.75,267.22,Returning,0.09,Cash,Online,North-Bob
1,1093,2023-04-21,Bob,West,4384.02,17,Furniture,3816.39,4209.44,Returning,0.11,Cash,Retail,West-Bob
2,1015,2023-09-21,David,South,4631.23,30,Food,261.56,371.40,Returning,0.20,Bank Transfer,Retail,South-David
3,1072,2023-08-24,Bob,South,2167.94,39,Clothing,4330.03,4467.75,New,0.02,Credit Card,Retail,South-Bob
4,1061,2023-03-24,Charlie,East,3750.20,13,Electronics,637.37,692.71,New,0.08,Credit Card,Online,East-Charlie

In [50]:
data_row = data.loc[0]

In [51]:
data_row

Product_ID                    1052
Sale_Date               2023-02-03
Sales_Rep                      Bob
Region                       North
Sales_Amount               5053.97
Quantity_Sold                   18
Product_Category         Furniture
Unit_Cost                   152.75
Unit_Price                  267.22
Customer_Type            Returning
Discount                      0.09
Payment_Method                Cash
Sales_Channel               Online
Region_and_Sales_Rep     North-Bob
Name: 0, dtype: object

In [52]:
sales_date = data_row['Sale_Date']

In [53]:
sales_date

'2023-02-03'

In [54]:
new_date = pd.to_datetime(sales_date)

In [55]:
new_date

Timestamp('2023-02-03 00:00:00')

In [56]:
print(new_date.year)

2023

In [57]:
print(new_date.month)

2

In [58]:
print(new_date.day)

3

In [59]:
df = pd.DataFrame({'city':['kochi','kochi','bangalore'],'population':[6000000,6000000,7000000]})

In [60]:
df

        city  population
0      kochi     6000000
1      kochi     6000000
2  bangalore     7000000

In [61]:
df.groupby('city').mean()

           population
city
bangalore   7000000.0
kochi       6000000.0

In [62]:
df.groupby('city').agg({'population':['min','max','mean']})

          population
                 min      max       mean
city
bangalore    7000000  7000000  7000000.0
kochi        6000000  6000000  6000000.0

In [63]:
df = df.groupby('city').mean()

In [64]:
df

           population
city
bangalore   7000000.0
kochi       6000000.0

In [75]:
df

   level_0  index       city  population
0        0      0  bangalore   7000000.0
1        1      1      kochi   6000000.0

In [78]:
df

   level_0  index       city  population
0        0      0  bangalore   7000000.0
1        1      1      kochi   6000000.0